Repository: katagaki/SakuraRSS
Catalog: Shared/Strings/AppIntents.xcstrings
Source language: en
Languages: de, fr, it, ja, ko, vi, zh_hans, zh_hant

# AddFeedFromURL.Description
source: Subscribes to the feed at the given URL. Returns true if the feed was added.
de: Abonniert den Feed an der angegebenen URL. Gibt „true“ zurück, wenn der Feed hinzugefügt wurde.
fr: S'abonne au flux à l'URL donnée. Renvoie vrai si le flux a été ajouté.
it: Si iscrive al feed all'URL fornito. Restituisce vero se il feed è stato aggiunto.
ja: 指定されたURLのフィードを購読します。追加された場合は true を返します。
ko: 지정된 URL의 피드를 구독합니다. 추가된 경우 true를 반환합니다.
vi: Đăng ký nguồn cấp tại URL được cung cấp. Trả về true nếu đã thêm.
zh_hans: 订阅给定 URL 的订阅源。添加成功时返回 true。
zh_hant: 訂閱指定 URL 的訂閱源。加入成功時回傳 true。

# AddFeedFromURL.ShortTitle
source: Add Feed
de: Feed hinzufügen
fr: Ajouter un flux
it: Aggiungi feed
ja: フィードを追加
ko: 피드 추가
vi: Thêm nguồn cấp
zh_hans: 添加订阅源
zh_hant: 加入訂閱源

# AddFeedFromURL.Title
source: Add Feed from URL
de: Feed von URL hinzufügen
fr: Ajouter un flux depuis une URL
it: Aggiungi feed da URL
ja: URLからフィードを追加
ko: URL에서 피드 추가
vi: Thêm nguồn cấp từ URL
zh_hans: 从 URL 添加订阅源
zh_hant: 從 URL 加入訂閱源

# AddToBookmarks.Description
source: Bookmarks the given piece of content. Returns true if the bookmark was newly added.
de: Setzt ein Lesezeichen für den angegebenen Inhalt. Gibt „true“ zurück, wenn das Lesezeichen neu hinzugefügt wurde.
fr: Ajoute le contenu donné aux favoris. Renvoie vrai si le favori a été ajouté.
it: Aggiunge il contenuto fornito ai segnalibri. Restituisce vero se il segnalibro è stato appena aggiunto.
ja: 指定されたコンテンツをブックマークに追加します。新しく追加された場合は true を返します。
ko: 지정된 콘텐츠를 북마크에 추가합니다. 새로 추가된 경우 true를 반환합니다.
vi: Đánh dấu nội dung đã cho. Trả về true nếu dấu trang vừa được thêm.
zh_hans: 将给定内容加入书签。新增成功时返回 true。
zh_hant: 將指定內容加入書籤。新加入時回傳 true。

# AddToBookmarks.Parameter.Article
source: Content
de: Inhalt
fr: Contenu
it: Contenuto
ja: コンテンツ
ko: 콘텐츠
vi: Nội dung
zh_hans: 内容
zh_hant: 內容

# AddToBookmarks.ShortTitle
source: Bookmark
de: Lesezeichen
fr: Favori
it: Segnalibro
ja: ブックマーク
ko: 북마크
vi: Dấu trang
zh_hans: 书签
zh_hant: 書籤

# AddToBookmarks.Title
source: Add to Bookmarks
de: Zu Lesezeichen hinzufügen
fr: Ajouter aux favoris
it: Aggiungi ai segnalibri
ja: ブックマークに追加
ko: 북마크에 추가
vi: Thêm vào dấu trang
zh_hans: 添加到书签
zh_hant: 加入書籤

# Article
source: Content
de: Inhalt
fr: Contenu
it: Contenuto
ja: コンテンツ
ko: 콘텐츠
vi: Nội dung
zh_hans: 内容
zh_hant: 內容

source: Bookmark
de: Lesezeichen
fr: Favori
it: Segnalibro
ja: ブックマーク
ko: 북마크
vi: Dấu trang
zh_hans: 书签
zh_hant: 書籤

source: Content Block
de: Inhaltsblock
fr: Bloc de contenu
it: Blocco di contenuto
ja: コンテンツブロック
ko: 콘텐츠 블록
vi: Khối nội dung
zh_hans: 内容块
zh_hant: 內容區塊

# ContentBlock.Kind
source: Kind
de: Art
fr: Type
it: Tipo
ja: 種類
ko: 유형
vi: Loại
zh_hans: 类型
zh_hant: 類型

# ContentBlock.Kind.Embed
source: Embed
de: Eingebettet
fr: Intégration
it: Incorporato
ja: 埋め込み
ko: 임베드
vi: Nội dung nhúng
zh_hans: 嵌入
zh_hant: 嵌入內容

# ContentBlock.Kind.Image
source: Image
de: Bild
it: Immagine
ja: 画像
ko: 이미지
vi: Hình ảnh
zh_hans: 图片
zh_hant: 圖片

# ContentBlock.Kind.Math
source: Math
de: Formel
fr: Formule
it: Formula
ja: 数式
ko: 수식
vi: Công thức
zh_hans: 公式
zh_hant: 公式

# ContentBlock.Kind.Table
source: Table
de: Tabelle
fr: Tableau
it: Tabella
ja: テーブル
ko: 표
vi: Bảng
zh_hans: 表格
zh_hant: 表格

# ContentBlock.Kind.XPost
source: X Post
de: X-Beitrag
fr: Publication X
it: Post X
ja: Xの投稿
ko: X 게시물
vi: Bài đăng X
zh_hans: X 帖子
zh_hant: X 貼文

# GetContentText.Description
source: Extracts the full body of the given piece of content as a list of blocks.
de: Extrahiert den gesamten Text des angegebenen Inhalts als Liste von Blöcken.
fr: Extrait l'intégralité du contenu donné sous forme de liste de blocs.
it: Estrae l'intero testo del contenuto fornito come elenco di blocchi.
ja: 指定されたコンテンツの本文をブロックのリストとして抽出します。
ko: 지정된 콘텐츠의 전체 본문을 블록 목록으로 추출합니다.
vi: Trích xuất toàn bộ nội dung dưới dạng danh sách các khối.
zh_hans: 将给定内容的正文提取为块列表。
zh_hant: 將指定內容的本文提取為區塊列表。

# GetContentText.Parameter.Article
source: Content
de: Inhalt
fr: Contenu
it: Contenuto
ja: コンテンツ
ko: 콘텐츠
vi: Nội dung
zh_hans: 内容
zh_hant: 內容

# GetContentText.ShortTitle
source: Content Text
de: Inhaltstext
fr: Texte du contenu
it: Testo del contenuto
ja: コンテンツのテキスト
ko: 콘텐츠 텍스트
vi: Văn bản nội dung
zh_hans: 内容正文
zh_hant: 內容文字

# GetContentText.Title
source: Get Content Text
de: Inhaltstext abrufen
fr: Obtenir le texte du contenu
it: Ottieni il testo del contenuto
ja: コンテンツのテキストを取得
ko: 콘텐츠 텍스트 가져오기
vi: Lấy văn bản nội dung
zh_hans: 获取内容正文
zh_hant: 取得內容文字

# GetLatestContent.Description
source: Returns the most recent piece of content from a feed, list, topic, or person.
de: Gibt den neuesten Inhalt aus einem Feed, einer Liste, einem Thema oder einer Person zurück.
fr: Renvoie le contenu le plus récent d'un flux, d'une liste, d'un sujet ou d'une personne.
it: Restituisce il contenuto più recente da un feed, un elenco, un argomento o una persona.
ja: フィード、リスト、トピックまたは人物から最新のコンテンツを返します。
ko: 피드, 목록, 주제 또는 인물에서 가장 최근 콘텐츠를 반환합니다.
vi: Trả về nội dung mới nhất từ một nguồn cấp, danh sách, chủ đề hoặc người.
zh_hans: 从订阅源、列表、话题或人物返回最新内容。
zh_hant: 從訂閱源、列表、話題或人物返回最新內容。

# GetLatestContent.Parameter.List
source: List
de: Liste
fr: Liste
it: Elenco
ja: リスト
ko: 목록
vi: Danh sách
zh_hans: 列表
zh_hant: 列表

# GetLatestContent.Parameter.Topic
source: Topic or Person
de: Thema oder Person
fr: Sujet ou personne
it: Argomento o persona
ja: トピックまたは人物
ko: 주제 또는 인물
vi: Chủ đề hoặc người
zh_hans: 话题或人物
zh_hant: 話題或人物

# GetLatestContent.ShortTitle
source: Latest Content
de: Neueste Inhalte
fr: Dernier contenu
it: Ultimi contenuti
ja: 最新のコンテンツ
ko: 최신 콘텐츠
vi: Nội dung mới nhất
zh_hans: 最新内容
zh_hant: 最新內容

# GetLatestContent.Title
source: Get Latest Content
de: Neueste Inhalte abrufen
fr: Obtenir le dernier contenu
it: Ottieni gli ultimi contenuti
ja: 最新のコンテンツを取得
ko: 최신 콘텐츠 가져오기
vi: Lấy nội dung mới nhất
zh_hans: 获取最新内容
zh_hant: 取得最新內容

# GetOPML.Description
source: Returns the current subscriptions as an OPML document.
de: Gibt die aktuellen Abonnements als OPML-Dokument zurück.
fr: Renvoie les abonnements actuels sous forme de document OPML.
it: Restituisce le iscrizioni correnti come documento OPML.
ja: 現在の購読をOPML文書として返します。
ko: 현재 구독을 OPML 문서로 반환합니다.
vi: Trả về danh sách đăng ký hiện tại dưới dạng tài liệu OPML.
zh_hans: 将当前订阅作为 OPML 文档返回。
zh_hant: 將目前的訂閱作為 OPML 文件返回。

# GetOPML.ShortTitle
source: Export OPML
de: OPML exportieren
fr: Exporter OPML
it: Esporta OPML
ja: OPMLをエクスポート
ko: OPML 내보내기
vi: Xuất OPML
zh_hans: 导出 OPML
zh_hant: 匯出 OPML

# GetOPML.Title
source: Export Feeds as OPML
de: Feeds als OPML exportieren
fr: Exporter les flux en OPML
it: Esporta feed come OPML
ja: フィードをOPMLとしてエクスポート
ko: 피드를 OPML로 내보내기
vi: Xuất nguồn cấp dưới dạng OPML
zh_hans: 导出订阅源为 OPML
zh_hant: 匯出訂閱源為 OPML

# GetTopicsAndPeople.Description
source: Returns the most-mentioned topics and people from recent content.
de: Gibt die am häufigsten erwähnten Themen und Personen aus den letzten Inhalten zurück.
fr: Renvoie les sujets et les personnes les plus mentionnés dans les contenus récents.
it: Restituisce gli argomenti e le persone più menzionati dai contenuti recenti.
ja: 最近のコンテンツで最も言及されたトピックと人物を返します。
ko: 최근 콘텐츠에서 가장 많이 언급된 주제와 인물을 반환합니다.
vi: Trả về các chủ đề và người được nhắc đến nhiều nhất trong nội dung gần đây.
zh_hans: 返回近期内容中提及最多的话题和人物。
zh_hant: 返回近期內容中提及最多的話題與人物。

# GetTopicsAndPeople.Parameter.Count
source: Top N
de: Anzahl
fr: Nombre
it: Numero
ja: 上位件数
ko: 상위 개수
vi: Số lượng
zh_hans: 前 N 个
zh_hant: 前 N 個

# GetTopicsAndPeople.ShortTitle
source: Topics & People
de: Themen & Personen
fr: Sujets & personnes
it: Argomenti & persone
ja: トピックと人物
ko: 주제 및 인물
vi: Chủ đề và người
zh_hans: 话题与人物
zh_hant: 話題與人物

# GetTopicsAndPeople.Title
source: Get Topics & People
de: Themen & Personen abrufen
fr: Obtenir sujets et personnes
it: Ottieni argomenti e persone
ja: トピックと人物を取得
ko: 주제 및 인물 가져오기
vi: Lấy chủ đề và người
zh_hans: 获取话题和人物
zh_hant: 取得話題與人物

source: List
de: Liste
fr: Liste
it: Elenco
ja: リスト
ko: 목록
vi: Danh sách
zh_hans: 列表
zh_hant: 列表

# RefreshFeeds.Description
source: Refreshes all subscribed feeds and returns the number that were updated.
de: Aktualisiert alle abonnierten Feeds und gibt die Anzahl der aktualisierten Feeds zurück.
fr: Actualise tous les flux abonnés et renvoie le nombre de flux mis à jour.
it: Aggiorna tutti i feed iscritti e restituisce il numero di feed aggiornati.
ja: 購読中のすべてのフィードを更新し、更新された数を返します。
ko: 구독 중인 모든 피드를 새로 고치고 업데이트된 개수를 반환합니다.
vi: Làm mới tất cả các nguồn cấp đã đăng ký và trả về số đã cập nhật.
zh_hans: 刷新所有已订阅的订阅源并返回已更新的数量。
zh_hant: 重新整理所有已訂閱的訂閱源並返回已更新的數量。

# RefreshFeeds.ShortTitle
source: Refresh
de: Aktualisieren
fr: Actualiser
it: Aggiorna
ja: 更新
ko: 새로 고침
vi: Làm mới
zh_hans: 刷新
zh_hant: 重新整理

# RefreshFeeds.Title
source: Refresh Feeds
de: Feeds aktualisieren
fr: Actualiser les flux
it: Aggiorna feed
ja: フィードを更新
ko: 피드 새로 고침
vi: Làm mới nguồn cấp
zh_hans: 刷新订阅源
zh_hant: 重新整理訂閱源

# SearchContent.Description
source: Searches saved content by keyword and returns matching items.
de: Sucht in gespeicherten Inhalten nach einem Stichwort und gibt passende Einträge zurück.
fr: Recherche dans le contenu enregistré par mot-clé et renvoie les éléments correspondants.
it: Cerca tra i contenuti salvati per parola chiave e restituisce gli elementi corrispondenti.
ja: 保存されたコンテンツをキーワードで検索し、一致するアイテムを返します。
ko: 저장된 콘텐츠를 키워드로 검색하고 일치하는 항목을 반환합니다.
vi: Tìm trong nội dung đã lưu theo từ khóa và trả về các mục khớp.
zh_hans: 按关键词搜索已保存的内容并返回匹配项。
zh_hant: 依關鍵字搜尋已儲存的內容並返回符合項目。

# SearchContent.Parameter.Keyword
source: Keyword
de: Stichwort
fr: Mot-clé
it: Parola chiave
ja: キーワード
ko: 키워드
vi: Từ khóa
zh_hans: 关键词
zh_hant: 關鍵字

# SearchContent.Parameter.Limit
source: Maximum results
de: Maximale Ergebnisse
fr: Résultats maximum
it: Risultati massimi
ja: 最大件数
ko: 최대 결과 수
vi: Số lượng tối đa
zh_hans: 最大结果数
zh_hant: 最多結果數

# SearchContent.ShortTitle
source: Search
de: Suchen
fr: Rechercher
it: Cerca
ja: 検索
ko: 검색
vi: Tìm kiếm
zh_hans: 搜索
zh_hant: 搜尋

# SearchContent.Title
source: Search Content
de: Inhalte durchsuchen
fr: Rechercher du contenu
it: Cerca contenuti
ja: コンテンツを検索
ko: 콘텐츠 검색
vi: Tìm kiếm nội dung
zh_hans: 搜索内容
zh_hant: 搜尋內容

# TopicPerson
source: Topic or Person
de: Thema oder Person
fr: Sujet ou personne
it: Argomento o persona
ja: トピックまたは人物
ko: 주제 또는 인물
vi: Chủ đề hoặc người
zh_hans: 话题或人物
zh_hant: 話題或人物

# TopicPerson.Kind
source: Kind
de: Art
fr: Type
it: Tipo
ja: 種類
ko: 유형
vi: Loại
zh_hans: 类型
zh_hant: 類型

# TopicPerson.Kind.Topic
source: Topic
de: Thema
fr: Sujet
it: Argomento
ja: トピック
ko: 주제
vi: Chủ đề
zh_hans: 话题
zh_hant: 話題

# ContentBlock.Kind.Text
source: Text
fr: Texte
it: Testo
ja: テキスト
ko: 텍스트
vi: Văn bản
zh_hans: 文本
zh_hant: 文字

# ContentBlock.Kind.Video
source: Video
fr: Vidéo
ja: 動画
ko: 동영상
zh_hans: 视频
zh_hant: 影片

source: Feed
fr: Flux
ja: フィード
ko: 피드
vi: Nguồn cấp
zh_hans: 订阅源
zh_hant: 訂閱源

# GetLatestContent.Parameter.Feed
source: Feed
fr: Flux
ja: フィード
ko: 피드
vi: Nguồn cấp
zh_hans: 订阅源
zh_hant: 訂閱源

# TopicPerson.Kind.Person
source: Person
fr: Personne
it: Persona
ja: 人物
ko: 인물
vi: Người
zh_hans: 人物
zh_hant: 人物

# ContentBlock.Kind.Code
source: Code
it: Codice
ja: コード
ko: 코드
vi: Mã
zh_hans: 代码
zh_hant: 程式碼

# ContentBlock.Kind.Audio
source: Audio
ja: オーディオ
ko: 오디오
vi: Âm thanh
zh_hans: 音频
zh_hant: 音訊
